package ru;

public class Information {
    /**
     1. Bean - это просто Java объект. Beans создаются из Java классов(так же, как и обычные объекты)

     2. loC - Inversion of Control, это когда сущность не сама создаёт свои зависимости, а когда к этой сущности зависимости поставляются из вне.

     3. Хороший архитектурный паттерн - программирование на уровне интерфейсов.

     4. Spring можно конфигурировать с помощью:
            - XML файла конфигурации(старый способ)
            - Java аннотаций и немного XML(современный способ)
            - Вся конфигурация на Java коде(современный способ)

     5. На этом уроке внедрили зависимость MusicPLayer вручную, но на след. уроке сделаем это с помощью Spring.

     6. Dependency Injection(DI) - когда с помощью спринга мы внедрили зависимость.

     7. В файлах формата .properties записывается всё ключ=значение
     */
}
